; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Rafel Hidalgo i Rangel <feta80@gmail.com>
; Homepage:	
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Cancel·la"
MAIN_DEST_DIR_LABEL = "&Directori de Destinaciу:"
MAIN_FILE_LABEL = "&Arxiu/Instal·lador per a extraure:"
MENU_FILE_LABEL = "&Fitxer"
MENU_FILE_QUIT_LABEL = "&Para"
MENU_EDIT_LABEL = "&Edita"
MENU_EDIT_PREFS_LABEL = "&Preferиncies"
MENU_HELP_LABEL = "&Ajuda"
MENU_HELP_WEB_LABEL = "%s &Lloc Web"
PREFS_TITLE_LABEL = "Preferиncies"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opcions d'Universal Extractor"
PREFS_HISTORY_LABEL = "Mantнn l'historial d'arxius"
PREFS_FORMAT_OPTS_LABEL = "Opcions especнfiques de Format"
PREFS_LANG_LABEL = "&Llengua"
PREFS_DEBUG_LABEL = "&Ubicaciу de l'arxiu de depuraciу:"
PREFS_WARN_EXECUTE_LABEL = "&Avisa abans d'executar fitxers"
PREFS_REMOVE_DUPE_LABEL = "&Elimina &fitxers duplicats"
PREFS_REMOVE_TEMP_LABEL = "Elimina &fitxers temporals"
PREFS_APPEND_EXT_LABEL = "&Afegix extensions d'arxiu perdudes"
METHOD_ADMIN_RADIO = "%s Instal·lador Administratiu"
METHOD_EXTRACTION_RADIO = "%s extracciу"
METHOD_HEADER = "%s Extracciу"
METHOD_MSI_NOTE_LABEL = "Nota:"
METHOD_MSI_REQUIRES_LABEL = "Necessiteu el msi2xml"
METHOD_MSI_URL_LABEL = "Processador MSXML 4.0"
METHOD_RADIO_LABEL = "Mиtode d'extracciу"
METHOD_SWITCH_RADIO = "%s Interconnector"
METHOD_NOTIS_RADIO = "No un instal·lador InstallShield"
METHOD_TEXT_LABEL = "%s suporta els segьents mиtodes d'extracciу %s de paquets.  Malauradament, cap dels mиtodes sуn 100% fiables. Si el mиtode predefinit no funciona per favor, torneu a utilitzar %s seleccionant un mиtode alternatiu."
METHOD_UNPACKER_RADIO = "%s Descompactador"

; GUI control functions
DOES_NOT_EXIST = "no existix.%n"
EXTRACT_TO = "Extrau a:"
INVALID_DIR_SELECTED =  "%s no йs un directori vаlid."
INVALID_FILE_SELECTED = "%sSeleccioneu un fitxer vаlid."
OPEN_FILE = "Obri fitxer"
SELECT_FILE = "Selecciona fitxer"
WRITE_TO = "Escriu a"

; Common terms
TERM_ARCHIVE = "arxiu"
TERM_COMPRESSED = "fitxer comprimit"
TERM_DISK = "disc"
TERM_EBOOK = "llibre electrтnic"
TERM_ECARD = "targeta electrтnica"
TERM_ENCODED = "fitxer codificat"
TERM_EXECUTABLE = "executable"
TERM_FAILED = "erroni"
TERM_HELP = "fitxer d'Ajuda"
TERM_HOTFIX = "revisiу"
TERM_IMAGE = "imatge"
TERM_INSTALLER = "instal·lador"
TERM_PACKAGE = "paquet"
TERM_PATCH = "pedaз"
TERM_SFX = "Autoextraпble"
TERM_STAGE = "Estat"
TERM_SUCCEEDED = "realitzat"
TERM_TESTING = "Provant"
TERM_UNKNOWN = "desconegut"
TERM_UNPACKED = "descompactat"
TERM_UPDATER = "actualitzador"

; Status messages
SCANNING_FILE = "Analitzant per a identificar el tipus de fitxer."
SCANNING_EXE = "Analitzant fitxer amb %s escаnner."
EXTRACTING = "Extraent fitxers de:"
INIT_WAIT = "Esperant la inicialitzaciу de l'instal·lador.%nPer favor, espereu."

; Custom prompts
CONVERT_CDROM = "La imatge de CD-ROM BIN/CUE no pot ser extreta automаticament. Esta imatge%nserа convertida en una imatge de CD-ROM ISO, la qual podrа ser extreta.%n%nDesitgeu continuar?%nNota: Este procйs pot tardar alguns minuts."
CONVERT_CDROM_STAGE1_FAILED = "Error: La imatge BIN/CUE no pot ser convertida.%nPer favor asegureu-vos que l'arxiu CUE estiga en el format correcte."
CONVERT_CDROM_STAGE2_FAILED = "Error: Una imatge ISO ha sigut creada a partir de la imatge BIN/CUE, perт no ha pogut ser convertida.%nDesitgeu preservar la imatge ISO per a anаlisis futures?"
CONVERT_BIN_MISSING = "Error: No es troba disponible:%n%s\%s.%s%n%nTots dos %s.bin i %s.cue sуn necessaris."
INIT_COMPLETE = "Inicialitzaciу %s. Per favor ixqueu de l'instal·lador, i desprйs premeu OK per a continuar"
WISE_MSI_PROMPT = ""Nota: Este mиtode nomйs funciona amb alguns paquets d'instal·laciу Wise per a Windows.%nSi l'assistent de l'instal·lador Wise s'obri i nomйs espera instruccions, este arxiu no йs%nsuportat. Per favor ixqueu de l'instal·lador, i %s interrompeu l'extracciу.%n%nDesitgeu continuar?"
UNPACK_PROMPT = "Este fitxer estа %s comprimit, perт potser puga ser extret.%nPot ser perquи el format no йs suportat, o %n simplement perquи йs un fitxer no inclтs per a extracciу.%n%nVoleu provar descompactar este fitxer?%n%nNota: El fitxer descompactat haurа de ser anomenat:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Error: %s%nNo pot ser descompactat."
WARN_EXECUTE = "Avнs:  Per a extraure este tipus de fitxers, el fitxer ha de ser executat.%ni continueu, la segьent orde serа executar:%n%n%s%n%nSi creus que el fitxer pot ser maliciуs, us recomanem que no continueu.%nVoleu continuar amb l'extraciiу?"

; Help text
HELP_SUMMARY = "Extrau el contingut de qualsevol tipus d'arxiu o paquet d'instal·laciу."
HELP_SYNTAX = "%nЪs:  %s [/help] [nomfitxer [destinaciу]]"
HELP_ARGUMENTS = "%n%nOpcions suportades:"
HELP_HELP = "%n     /help%t%tMostra la informaciу d'ajuda"
HELP_FILENAME = "%n     nomfitxer%tNom del fitxer per a extraure"
HELP_DESTINATION = "%n     destinaciу%tDirectori on extraure
HELP_SUB = "%n%nPassa /sub en lloc d'utilitzar un directori de destinaciу%n%s extrau l'arxiu a subdirectori."
HELP_EXAMPLE1 = "%n%nExemple:"
HELP_EXAMPLE2 = "%n     %s c:\1\exemple.zip c:\test"
HELP_NOARGS = "%n%nExecutant %s sense opcions se requerirа%n a l'usuari el nom del fitxer i directori de destinaciу."

; Error messages
CANNOT_LOG = "%s l'extracciу no ha pogut ser registrada."
CANNOT_DEBUG = "El directori d'eixida del fitxer de depuraciу, "%s", no es pot escriure.%nPerт serа usat el Directori de fitxers temporals."
CANNOT_EXTRACT = "%s no pot ser extret.%nEl tipus de fitxer retornat йs: %s%n%nElegiu OK si voleu analitzar el fitxer, o Cancel·la per a finalitzar."
UNKNOWN_EXT = "%s%nйs una extensiу desconeguda i no pot ser extreta."
INVALID_DIR = "%s%nno pot ser creat. Por favor seleccioneu una destinaciу vаlida."
EXTRACT_FAILED = "%s no ha pogut ser extret.%nSembla un(n) %s, el qual es suportat, perт l'extracciу ha fallat.%nPer favor llegiu el fitxer de registre (log), %s, per a mйs informaciу.%n%nSeleccioneu OK per a veure el fitxer de registre, o Cancel·la per a finalitzar"

[Installer]
; Components page
COMP_DOCS = "Documentaciу i informaciуde llicиncia"
COMP_LANG = "Fitxers de llengьes per a suport international"
COMP_ACE = "Suport per a fitxers ACE"
COMP_KGB = "Suport per a fitxers KGB"
COMP_PEA = "Suport per a fitxers Pea"
COMP_SIT = "Suport per a fitxers StuffIt"

; Preferences page
PREFS_CAPTION = "Opcions del programa"
PREFS_DESCRIPTION = "Quines opcions de l'Universal Extractor desitgeu elegir?"
PREFS_LABEL1 = "Podeu elegir les sigьents opcions per a predefinir el comportament de l'Universal Extractor."
PREFS_LABEL2 = "Estes opcions poden ser canviades desprйs de la instal·laciу modificant UniExtract.ini."
LANGUAGE_LABEL = "Llengua per defecte"
DEBUG_LABEL = "Ubicaciу del fitxer de depuraciу"
APPEND_EXT_LABEL = "&Afegix extensions de fitxer perdudes"
HISTORY_LABEL = "&Mantнn l'historial d'arxius"
REMOVE_DUPE_LABEL = "Elimina &fitxers duplicats"
REMOVE_TEMP_LABEL = "Elimina &fitxers temporals"
WARN_EXECUTE_LABEL = "&Avisa abans d'executar fitxers"

; Tasks page
ASSOCIATE = "&Habilita la integraciу amb el menъ de l'explorador del sistema"
ASSOCIATE_FILES = "Agrega Extrau amb UniExtract &Fitxers...' al menъ contextual"
ASSOCIATE_HERE = "Agrega Extrau amb UniExtract &Acн' al menъ contextual"
ASSOCIATE_SUBDIR = "Agrega Extrau amb UniExtract al &Subdirectori' al menъ contextual"
ASSOCIATE_FORCE = "Forзa l'&associaciу amb tots els formats de fitxers suportats"
MODIFY_PATH = "Agregar Universal Extractor a la &ruta d'accйs del sistema"
DESKTOP_ICON = "Crea una icona en l'&Escritori"
QUICK_LAUNCH_ICON = "Crea una icona d'&Inici Rаpid"
SENDTO_ICON = "Crea una icona Envia&A"

; Context Menu integration
EXTRACT_FILES = "Extrau amb UniExtract &Fitxers..."
EXTRACT_HERE = "Extrau amb UniExtract &Acн"
EXTRACT_SUB = "Extrau amb UniExtract a &Subdirectori"
